//给定一个二叉树，我们在树的节点上安装摄像头。
//
// 节点上的每个摄影头都可以监视其父对象、自身及其直接子对象。
//
// 计算监控树的所有节点所需的最小摄像头数量。
//
//
//
// 示例 1：
//
//
//
// 输入：[0,0,null,0,0]
//输出：1
//解释：如图所示，一台摄像头足以监控所有节点。
//
//
// 示例 2：
//
//
//
// 输入：[0,0,null,0,null,0,null,null,0]
//输出：2
//解释：需要至少两个摄像头来监视树的所有节点。 上图显示了摄像头放置的有效位置之一。
//
//
//
//提示：
//
//
// 给定树的节点数的范围是 [1, 1000]。
// 每个节点的值都是 0。
//
// Related Topics 树 深度优先搜索 动态规划
// 👍 171 👎 0


//leetcode submit region begin(Prohibit modification and deletion)
/**
 * Definition for a binary tree node.
 * struct TreeNode {
 *     int val;
 *     TreeNode *left;
 *     TreeNode *right;
 *     TreeNode(int x) : val(x), left(NULL), right(NULL) {}
 * };
 */

/**
 * 定义三种状态
 * 0：初始状态，如果节点为nullptr可返回0，不影响其他节点，
 * 当左右两个子节点都为0时，直接设置当前节点为未监控状态
 * 1：未监控状态，如果有子节点为该状态，则此节点必须添加摄像头，同时返回当前状态为监控状态
 * 2：监控状态：表明节点已被监控，当子节点为该状态时，父节点不需要添加摄像头，可返回初始状态
 */
class Solution {
private:
    int cam = 0;//摄像机数目

public:
    int dfs(TreeNode *root) {
        if (!root)
            return 0;
        int l = dfs(root->left); //左子节点状态
        int r = dfs(root->right);//右子节点状态
        if (l + r == 0) {
            return 1;
        } else if (l == 1 || r == 1) {
            cam++;
            return 2;
        } else {
            return 0;
        }
    }
    int minCameraCover(TreeNode *root) {
        TreeNode *pre = new TreeNode(0);
        pre->left = root;//为根节点添加一个虚拟头结点
        dfs(pre);
        return cam;
    }
};
//leetcode submit region end(Prohibit modification and deletion)
